package top.wzmyyj.data;

/**
 * Created by wzm on 2018/5/1 0001.
 */

public class Data_Article {

    protected static int[] head = new int[]{
            R.drawable.article_head_1,
            R.drawable.article_head_2,
            R.drawable.article_head_3,
            R.drawable.article_head_4,
            R.drawable.article_head_5,
            R.drawable.article_head_6,
            R.drawable.article_head_7,
            R.drawable.article_head_8,
            R.drawable.article_head_9,
            R.drawable.article_head_10,
            R.drawable.article_head_11,
            R.drawable.article_head_12,
            R.drawable.article_head_13,
            R.drawable.article_head_14,
            R.drawable.article_head_15,
            R.drawable.article_head_16,
            R.drawable.article_head_17,
            R.drawable.article_head_18,
            R.drawable.article_head_19,
            R.drawable.article_head_20
    };

    protected static String[] name = new String[]{
            "(●´ー｀●)",
            "Bubble",
            "未闻花名。",
            "Crazy VulCan",
            "酸菜豆腐汤",
            "北泽",
            "不争",
            "幼稚完",
            "栀雨",
            "有点甜又不是太甜",
            "Nxswl",
            "OBMIL",
            "无衣.",
            "Kawhi",
            "boy 丶",
            "游园惊梦",
            "紬 ヴェンダース",
            "Hey TeAmo",
            "那你很棒哦",
            "南素青栀"
    };

    protected static String[] title = new String[]{
            "西湖游",
            "野炊必备知识",
            "篮球的一些运球技巧",
            "台球技巧篇",
            "登山的一些准备",
            "环杭州城自行车骑行",
            "一起来打乒乓球",
            "学会这些，露营不再有任何问题",
            "篮球赛，激扬青春",
            "杭州乐园一日行",
            "烤肉火锅聚餐",
            "西溪湿地感想",
            "一起来撕名牌",
            "一起踢足球",
            "登山结伴",
            "KTV找伴",
            "商城找伴",
            "足球赛，敢来吗？",
            "腹肌撕裂者",
            "一起来打羽毛球"
    };


    protected static String[] content = new String[]{
            "西湖景区真的非常非常大，七月份来的，真的很热绕着西湖走了一圈，步数就三四万了。好就好在不要门票，雷峰塔要票，重建的，没什么感觉就没上去。晚上整点七点八点有音乐喷泉，高德搜索就可以导航过去，喷泉的背景是连绵不断的山，感觉绝对不一样，记得带上驱蚊的，去任何地方都要带，蚊虫比较多。想看音乐喷泉住在西湖附近比较好，早点，餐厅也很多。去了新白鹿，新丰小吃，知味居，都很赞。第二个景点可以去九溪十八涧，坐公交到龙井村站，这基本是山顶了，步行到杨梅岭，一直下山，路上会有很多人，夏天孩子比较多，在小溪里打水仗，很有生气，山上都是茶树。会有老阿姨拉着你买茶，想买就买点，也不贵。大家注意保护环境，人多垃圾就多。西溪湿地公园，没感觉有什么心意，坐船到哪都是很贵的，景区里各种大船小船，我自己一个人就没坐。住宿提前定，周末人多，更不建议法定假日来旅游。杭州人很热情的，街道干净，司机主动避让行人，天下奇观。给杭州点赞。下次带我爸妈再来",
            "建造一个达科他火坑比普通的篝火需要消耗更多的体力，但是相对与他带来的好处，这点付出还是值得的。达科他火坑能在煮食，烧开水，烤火的过程中为你节省大量的燃料。\n" +
                    "达科他火坑是非常有用的生活技巧，因为他的燃料燃烧效率很高，且热量集中，你可以使用尽量少的燃料得到更多的热量，这一点在很多木材或燃料稀少的地区显得尤为可贵，当你生火成功后，达科他火坑能让你把更多的时间用在野外生存的其他活动中，而不是不断的收集木材以维持篝火。此外，达科他火坑还创造了一个稳定的平台，这点对于煮食非常方便有用。\n" +
                    "如果你需要隐藏你的火堆不被别人发现，达科他火坑的火孔将是你的首选，他的结构能够限制可见烟雾升起的高度，由于燃烧点在地平面之下，火坑还能帮助你隐藏篝火的火光。要知道，在野外的夜晚，一个蜡烛的火焰都能在数英里之外被看见。\n" +
                    "建立一个达科他火坑\n" +
                    "在你开始挖掘达科他火坑之前，你应该先考察下你的营地，看土壤条件是否有利于你的挖掘。要避免以下地形：\n" +
                    "难挖的岩石\n" +
                    "在大树旁边，地下的树根将很难被切断\n" +
                    "潮湿的地面，挖掘后可能充满地下水\n" +
                    "松软的沙土，难以挖掘烟道\n" +
                    "根据相关的消防法规，野外生存挖掘火坑时，请务必注意安全，确保你的篝火在可控制范围内，以免引起森林火灾。尽量不要伤害到树木和植物的根系。\n" +
                    "先移除一个直径约12英寸的浅坑。现在，我们开始挖掘达科他火坑，如图所示，我使用的是工兵铲，很多野外生存者会携带小型的折叠铲或其他工具，它们也一样好用，你也可以使用棍子或者其他能够得到的工具进行挖掘，在野外生存，你必须善于利用一切能够获取的简易工具。主火坑需要挖掘约成人小腿深，坑的大小可以适当的挖的大一点，这样可能容纳较大的木材，省去了处理木材的时间和精力，而且火堆也相对大一些。\n" +
                    "接下来挖掘气道，在火坑边缘约一英尺的适当位置斜挖一条通道，地面的直径约为6英寸。",
            "将脚站为8字形 用右手打低球要速度快 从胯下慢慢打到你的左后方用你的左手在打低球  呈现出一个 8 字 脚踝一定要用力 不能移位置 一天练32组 对你运球有很大帮助\n" +
                    "当你怎么过防守人时 你要有个防守人在你面前 你要和他四目相对  并且眼睛不看球 用右手击球 球的高度不能超过腰部 左右手互换 当右手在击打时 你左手必须做出拦截的动作" +
                    "双手交替运球  在跑动运球时  先用左手拍篮球 在到腰部时 将球换到右手 在右手击拍时 换到左手 重复练习 必须走直线运球 最后走蛇形运球\n" +
                    "篮球的运球强化知识\n" +
                    " 当你遇到对方严谨防守时 你要先看对手站在你脚尖哪个位置 你要用手肘对着他的脸部 告诉他我随时要突破  给他心理压力 此时最好在做出试探步 可以和队友一天练习二十组\n" +
                    "篮球的运球强化知识\n" +
                    " 极速胯下运球过人 在对方防你时  你可以在原地快速进行胯下运球当你将球运到右胯下时 他必定向你那个方向重心偏离 你在变相向他反方向突破 他就来不及防守了\n" +
                    "篮球的运球强化知识\n" +
                    " 当你打的是中锋这个位置时 跳步是个很好的绝招 当你在运球到篮下时 防守人在防你  你可以左右脚同时出力跳到他对面 他会感到压力感 可以的话还能把他顶开 这样你就有上篮空间了\n" +
                    "篮球的运球强化知识\n" +
                    " 背身单打也是个技术活 你要靠着防守人 以左右脚一只脚为轴心脚 另只脚为发力脚用肩顶着对方往篮下冲 注意不能在转身时用肘袭击对方",
            "第一项( 架杆 )\n" +
                    "　　1。培养正确架杆和守备姿势， 手臂自然伸长而分僵直， 如此能助你目标球之锁定。\n" +
                    "　　2。经常练习拇指与四指之间的架桥高低姿势与位置， 力求能够放松， 扎实， 而稳定， 其对出杆之准确性有绝对影响。\n" +
                    "　　3。不要仅用指尖握杆， 更不可使用手腕力量紧握球杆， 轻提球杆方式最正确。\n" +
                    "　　4。母球与目标球接近时， 应缩短架杆距离， 而握杆位置也需适度配合前移， 反之则向后移 。\n" +
                    "第二项( 瞄准 )\n" +
                    "　　1。持杆的水平角度越小， 撞击的准度越精确 。\n" +
                    "　　2。握杆的肩膀线 ( 中心线 )要对准目标球的方向， 肩膀点在双脚重心点正上方 。\n" +
                    "　　3。保持下巴中心点 在球杆的正上方， 与鼻尖， 眉心， 成一直 线 。\n" +
                    "　　4。出杆前， 3~5 次的运杆即可， 超过 容易失去节奏感， 反而给自己增加不必要的压力 。\n" +
                    "第三项( 摆动 )\n" +
                    "　　1。运用球杆出杆摆动的速度， 来加强母球的速度; 而非使用手臂的力量， 去增加撞击的力量 。\n" +
                    "　　2。小臂自然下垂， 轻提球杆， 前后来回摆动， 力求节奏平稳顺畅， 尽量维持不变的速度 。\n" +
                    "　　3。回杆速度 ( 出杆前 最后一次抽回的动作 )， 尽量降至缓慢， 全神贯注， 身体不动如山， 一击而出， 此为准度之决定 。\n" +
                    "第四项( 出杆 )\n" +
                    "　　1。将打击要求的很柔软， 可以避免球杆反弹所造成的偏斜 。\n" +
                    "　　2。出杆前全神贯注于架杆点， 与母球之撞击点之精确位置， 出杆时将注意力转移 集中于目标球 。\n" +
                    "　　3。出杆前察觉试瞄不完整而有怀疑时， 不可勉强出杆， 应站起来重新调整基本姿势 。\n" +
                    "第五项( 延伸 )\n" +
                    "　　1。出击后， 动作顺势而下， 一气呵成， 确实完成出杆动作 。\n" +
                    "　　2。击球后， 暂时保持原来姿势， 不要立即站起来， 务求达到完整节奏感 及 延伸的动作 。\n" +
                    "　　3。球杆前截扬起， 或是左右偏斜， 以及身体各部的晃动， 均会造成准度的失误。\n" +
                    "第六项( 姿势 )\n" +
                    "　　1。要求姿势的稳定与身体的平衡最重要， 它可以抵销球杆撞击时所产生的反弹与振动， 熟练头，手，脚， 和身体各部的正确位置 。\n" +
                    "　　2。固定标准姿势， 其感觉轻松自然 又很舒适 就对了， 无须刻意去模彷他人， 除非其姿势 确实 很适合你\n" +
                    "第七项( 加塞 )\n" +
                    "　　1。尽量不要使用加塞球， 因为它比你想像中更难控制， 多利用中线上的杆点， 配合球型， 与角度， 走出你要的路线 。\n" +
                    "　　2。加塞时， 切忌使用身体的力量， 也就是所谓 身体加塞 的坏习惯， 它是缺乏信心的讯号， 更是造成延伸不直的致命伤 。\n" +
                    "　　3。切薄球时， 尽量使用下低杆， 可以减少母球撞击子球时， 所产生不必要的摩擦力 ( 目标球明显不正常的旋转 ) 。\n" +
                    "第八项( 超越 )\n" +
                    "　　1。练球的目的， 在于提升自己本身的实力水准， 而非仅以打败对手为荣 。\n" +
                    "　　2。尽量找球技比自己好的球伴切磋， 并互相研究， 比较能够有所吸收和助益 。\n" +
                    "　　3。以求艺之心态为出发点， 抛弃输赢， 而着重于球赛中的理解和分析， 如此更有助于改善和提升 。\n" +
                    "　　4。固定的练习， 经常性的比赛， 可学习到更多面的观念与技巧， 并增加自己的稳定性及抗压力， 是成为高手的必经途径。",
            "短时间内爬一些景点的小山，如千佛山、英雄山，不需要什么样的装备，但不要穿皮鞋、新鞋、高跟鞋和凉鞋，穿着这些鞋不适宜走远路、高低不平的路以及湿滑的路，而且足底易起水泡，脚部皮肤易受伤。适宜登山的是较轻便的运动鞋、旅游鞋和胶底布鞋。但如果是要爬野山，有一定高度，且有攀爬难度的山，则最好配有如下的装备：\n" +
                    "(1)地图，(2)指北针，(3)头灯(含备用灯泡与电池)，(4)备用食物和水，(5)备用衣物，(6)太阳眼镜，(7)瑞士军刀，(8)火种，(9)打火机，(10)急救箱。\n" +
                    "在夏季时可备有以下几种常用药品，以防急用。\n" +
                    "1．防中暑备用药：人丹、十滴水、藿香正气水等。\n" +
                    "2．蚊叮、虫咬引起的皮肤瘙痒备用药：风油精、清凉油、红花油等。",
            "环杭州城区绕行一周，比拼耐力，一场毅力的斗争",
            "一块打乒乓球，找个常伴，可以经常一块打",
            "1.帐篷:选择结构稳定、重量轻、抗风、防雨性能较强的双层帐篷为佳\n" +
                    "2.睡袋:羽绒或鹅绒睡袋轻便,保暖效果好,但前提是必须保持干燥,环境条件比较潮湿时,人造真空绵睡袋可能是更好的选择\n" +
                    "3.背包:背包负重的秘密在于,它将大部分重量分担在臀部上,背包构架应符合自己的身体结构,并有结实而舒适的腰带\n" +
                    "4.生火用具:打火机、火柴、蜡烛、放大镜。其中蜡烛既可用作光源,又是极好的助燃剂\n" +
                    "5.野炊用具:水壶、多功能野炊锅、锋利的多功能折刀、 餐具\n" +
                    "6.专用工具:指南针、地图、绳索、折叠锹、手电筒、针线、鱼钩鱼线、砍刀、照相机",
            "篮 球 比 赛 通 知\n" +
                    "　　为了进一步丰富职工的文化生活，以快乐体育为基础，增强员工的身体素质，增加员工之间的交流。 2010年 5 月 8 日将迎来办公室与装配部两部门之间的篮球友谊比赛，请公司员工到时亲临现场观看。\n" +
                    "　　一、比赛名称：男子篮球赛\n" +
                    "　　二、比赛地点：校篮球场地\n" +
                    "　　三、比赛时间：2010 年 5 月 8 日，傍晚 18： 00 — 19 ： 00\n" +
                    "　　四、比赛队伍：办公室、装配部；每队参赛队员限报 5-7 名\n" +
                    "　　五、比赛裁判：肖飞、刘刚）\n" +
                    "　　六、比赛记分：鲁晓庆\n" +
                    "　　七、竞赛规则：\n" +
                    "　　1 、本次比赛采用篮球比赛赛规则，采取“四人制”比赛。\n" +
                    "　　2 、比赛分四小节，每节 15 分钟，场中休息 5 分钟。\n" +
                    "　　4 、比赛每节可两次换人的机会。每节比赛最后三分钟不许叫暂停。\n" +
                    "　　八、参赛要求：\n" +
                    "　　1 、遵守比赛规则，服从裁判指挥，如因此打架，将取消比赛资格。\n" +
                    "　　2 、服装整齐，尽量穿上自己的运动服装比赛。\n" +
                    "　　3 、遇到规则外的问题，由裁判组裁决。\n" +
                    "　　4 、请两方队长尽快落实好比赛的队员。",
            "在杭州乐园游玩一天，玩比较刺激的项目，比如过山车，海盗船。杭州乐园位于杭州萧山区风情大道2555号（休博园），占地800亩，距西湖12公里。它是长三角地区最具特色的综合性主题公园，以\"主题突出、晴雨皆宜、老少同乐\" 为设计理念，由玛雅部落、冒险岛、失落丛林、童话王国、杭州乐园水公园、吴越古城、吴越千古情大剧院、杭州乐园生态园等特色区块组成，拥有悬挂过山车、雨神之锤、风神之手、雷神怒吼、穿越云霄等数十项顶级游乐。\n" +
                    "\n" +
                    "　　杭州乐园一年四季活动不断，嬉水节、万圣节等主题活动，天天像过节。另外每晚在杭州乐园大剧院上演大型歌舞《吴越千古情》。以全景环绕演出方式，让观众身临其境地感受地动山摇、狂风呼啸、大雪飘零、万箭齐发、烈焰冲天史诗般的宏大场景。《吴越千古情》围绕杭州历史，以吴越争霸、西施范蠡的爱情故事为主线，分为湘湖渔火、情定湘湖、风雪囚途、西施浣纱、惊艳吴宫、复国水战、和平颂五幕，演绎了一曲荡气回肠的春秋绝恋，将那段埋没在萧山湘湖三万顷碧波下的吴越文化带入大家的视野。它的推出让杭州的文化属性更加鲜明，填补杭州江南文化空白，形成一南一北两大文化高峰。",
            "聚在自助烤肉火锅店，一块边吃边谈天说地",
            "高庄:高庄的荷花搪.亭台楼阁,小桥流水,曲径通幽,宛如诗画,太美了,非常值得一看.\n" +
                    "河渚老街:街道两边是古色古香的杭州老店,老街上矗立着一座河渚塔,登塔顶,可望见全景,真所谓八面云开八面风.河渚广场上有现场打\"麻兹\"的,现打现买.\n" +
                    "西侧的水生花园值得一看,若有小孩子的,可以玩水上走球节目,在水生花园里,可以采水菱,花园弯弯曲曲,看了心旷神怡.",
            "游戏一般分为两组或者三组（也可以是个人赛），每个人后背上都会贴上自己的名字，叫做名牌。然后对战开始，双方在不伤害对方的情况下可以采用运动战或者正面对战，想方设法把对方后背上的名牌撕下来即为胜利者，比如A队两个人把B队两人的名牌全部撕下，即A队获胜。如果途中一人名牌被撕，则被撕名牌者淘汰",
            "比赛目的是尽量将足球射入对方的球门内，每射入一球就可以得到一分，当比赛完毕后，得分多的一队则胜出。如果在比赛规定时间内得分相同，则须看比赛章则而定，可以抽签、加时再赛或互射点球（十二码）等形式比赛分高下。足球比赛中除了守门员可以在己方禁区内利用手部接触足球外，球场上每名球员只可以利用手以外的身体其他部分控制足球（开界外球例外）。",
            "经常出外进行登山野营活动对人体有很大的好处，从医学角度来说，它对人的视力、心肺功能、四肢协调能力、体内多余脂肪的消耗、延缓人体衰老等五个方面有直接的益处。登山对人的身心健康大有好处，但也潜伏着一定危险。为了保证安全，应该做到；\n" +
                    "登山时有老师或家长带领，要集体行动。\n" +
                    "登山的地点应该慎重选择。要向附近居民了解清楚当地的地理环境和天气变化的情况，选择一条安全的登山路线，并做好标记，防止迷路。\n" +
                    "备好运动鞋、绳索、干粮和水。在夏季，一定要带足水，因为登山会出汗，如果不补充足够的水分，容易发生虚脱、中暑。\n" +
                    "最好随身携带急救药品，如抗高反药品、云南白药、止血绷带等，以便在发生高反、摔伤、碰伤、扭伤时派上用场。\n" +
                    "登山时间最好放在早晨或上午，午后应该下山返回驻地。不要擅自改变登山路线和时间。\n" +
                    "背包不要手提，要背在双肩，以便于双手抓攀。还可以用结实的长棍作手杖，帮助攀登。\n" +
                    "千万不要在危险的崖边照相，以防发生意外。\n" +
                    "对于团体登山可自行购买短期团体出游意外保险。",
            "一起在KTV唱唱歌，聊聊天，玩狼人杀等游戏",
            "一块去商场逛街，买衣服，买小吃，看电影等等",
            "为了进一步丰富职工的文化生活，以快乐体育为基础，增强员工的身体素质，增加员工之间的交流。 2010年 5 月 8 日将迎来办公室与装配部两部门之间的篮球友谊比赛，请公司员工到时亲临现场观看。\n" +
                    " 一、比赛名称：男子足球赛\n" +
                    " 二、比赛地点：公司篮球场地\n" +
                    " 三、比赛时间：2010 年 5 月 8 日，傍晚 18： 00 — 19 ： 00\n" +
                    " 四、比赛队伍：办公室、装配部；每队参赛队员限报 5-7 名\n" +
                    " 五、比赛裁判：肖飞（办公室领队）、刘刚（装配部领队）\n" +
                    " 六、比赛记分：鲁晓庆\n" +
                    " 七、竞赛规则：\n" +
                    " 1 、本次比赛采用篮球比赛赛规则，采取“四人制”比赛。\n" +
                    " 2 、比赛分四小节，每节 15 分钟，场中休息 5 分钟。\n" +
                    " 4 、比赛每节可两次换人的机会。每节比赛最后三分钟不许叫暂停。\n" +
                    " 八、参赛要求：\n" +
                    " 1 、遵守比赛规则，服从裁判指挥，如因此打架，将取消比赛资格。\n" +
                    " 2 、服装整齐，尽量穿上自己的运动服装比赛。\n" +
                    " 3 、遇到规则外的问题，由裁判组裁决。\n" +
                    " 4 、请两方队长尽快落实好比赛的队员。",
            "仰卧卷腹：\n" +
                    "训练部位：腹直肌上部\n" +
                    "动作要领：仰卧，大腿与小腿保持90度，双脚打开与肩部同宽，双手交叉搭在肩部。呼气头部，肩胛骨抬离地面，吸气还原。注意，手臂不要用力抱头避免对颈椎造成压力。\n" +
                    "塑造腹肌型男全攻略\n" +
                    "仰卧侧卷腹：\n" +
                    "训练部位：腹内斜肌，腹外斜肌\n" +
                    "动作要领：仰卧，大腿与小腿保持90度，双脚打开与肩部同宽，双手交叉搭在肩部。呼气头部，肩胛骨抬离地面，同时转体，右侧肩转向左膝位置。注意，手臂不要用力抱头避免对颈椎造成压力，同时抬起时控制肌肉用力，动作不要过分僵硬。\n" +
                    "塑造腹肌型男全攻略\n" +
                    "反向卷腹：\n" +
                    "训练部位：腹直肌下部\n" +
                    "动作要领：仰卧，双脚并拢抬起膝关节垂直于骨盆上方，双手放于身体两侧。顾盼向前上方卷动抬离地面，腰椎下半部部分抬离地面。注意腰椎不能过分离开地面避免对腰椎产生过大的压力，此动作适合中高级训练者。\n" +
                    "塑造腹肌型男全攻略\n" +
                    "塑造腹肌型男全攻略\n" +
                    "平板支撑：\n" +
                    "训练部位：腹横肌\n" +
                    "动作要领：俯卧，小臂和脚尖接触地面，挺胸，收腹，沉肩，保持头部，背部，臀部和脚跟在同一直线上。注意身体的稳定性，腰椎不要过分向下沉。",
            "一块打羽毛球"
    };

    protected static int[] image = new int[]{
            R.drawable.article_image_1,
            R.drawable.article_image_2,
            R.drawable.article_image_3,
            R.drawable.article_image_4,
            R.drawable.article_image_5,
            R.drawable.article_image_6,
            R.drawable.article_image_7,
            R.drawable.article_image_8,
            R.drawable.article_image_9,
            R.drawable.article_image_10,
            R.drawable.article_image_11,
            R.drawable.article_image_12,
            R.drawable.article_image_13,
            R.drawable.article_image_14,
            R.drawable.article_image_15,
            R.drawable.article_image_16,
            R.drawable.article_image_17,
            R.drawable.article_image_18,
            R.drawable.article_image_19,
            R.drawable.article_image_20,
    };

    protected static int[] comment = new int[]{
            56,
            14,
            16,
            17,
            14,
            4,
            14,
            12,
            125,
            15,
            124,
            22,
            520,
            25,
            125,
            64,
            55,
            112,
            32,
            97
    };

    protected static int[] like = new int[]{
            98,
            214,
            22,
            14,
            52,
            125,
            25,
            251,
            121,
            212,
            25,
            26,
            1314,
            21,
            22,
            62,
            65,
            75,
            25,
            82
    };

    protected static int[] tag = new int[]{
            1,
            4,
            4,
            4,
            3,
            2,
            3,
            3,
            1,
            2,
            3,
            1,
            1,
            2,
            4,
            2,
            1,
            2,
            1,
            1
    };
}
